# вводимо n
n = int(input("Enter a number(n): "))

# ітеруємось через числа від 1 до n включно
for i in range(1, n + 1):
    # кількість цифр у числі
    numLength = 0
    # коефіцієнт
    k = i

    # рахуємо кількість цифр у числі
    while k >= 1:
        # ділимо коефіцієнт на 10
        k /= 10
        # додаємо до кількості цифр одиницю
        numLength += 1

    # квадрат числа i
    square = pow(i, 2)
    # дільник
    divisor = pow(10, numLength)
    # ділимо квадрат числа i на дільник
    # наприклад, якщо квадрат i - двозначне число, то отримуємо остачу від вілення від 10
    # якщо квадрат i - тризначне число, то отримуємо остачу від вілення від 100 і т.д.
    condition = square % divisor

    # якщо остача від ділення дорівнює початковому числу i, то виводимо результат в консоль
    if condition == i:
        print(f"{i} = {square}")
