#include <iostream>
using namespace std;

int main()
{
    float a, d; //значення a, d (a - перший член арифметичної прогресії, d - різниця прогресії)
    int n; //значення n (n - кількість членів прогресії)  
	
    cout << "a = "; // виводимо текст в консоль
    cin >> a; //введення a
    cout << "d = "; // виводимо текст в консоль
    cin >> d; //введення d
    cout << "n = "; // виводимо текст в консоль
    cin >> n; //введення n
	
    float sum; //результат
    sum = (2 * a + d * (n - 1)) / 2 * n; //обчислення суми
    printf("The sum is %g", sum); //виведення результату
}